# Usage of map()
- The map() function executes a specified function for each item in an iterable. The item is sent to the function as a parameter.  
- Syntax: <code>map(function, iterables)</code>
- Description from [w3school](https://www.w3schools.com/python/ref_func_map.asp)

--------

## 1. Convert a list of integers to a list of strings

In [4]:
years_list_int=list(range(2000,2005,1))
years_list_int

[2000, 2001, 2002, 2003, 2004]

In [5]:
years_list_str= list(map(str, years_list_int))
years_list_str

['2000', '2001', '2002', '2003', '2004']

----------------

## 2. Application to Pandas column names: Integer to string

In [6]:
import pandas as pd

### Generate DataFrame with integer column names: 2005, 2006, 2007

In [17]:
data_dict= {'id': [1,2,3], 2005:[100,120,130], 2006:[105,122,132], 2007:[150,100,150]}

In [8]:
df= pd.DataFrame(data_dict)
df.head()

   id  2005  2006  2007
0   1   100   105   150
1   2   120   122   100
2   3   130   132   150

In [9]:
df.columns

Index(['id', 2005, 2006, 2007], dtype='object')

In [10]:
df[[2005]]

   2005
0   100
1   120
2   130

### Convert the columns to string using map(): '2005', '2006', '2007'

In [11]:
list(map(str, df.columns))

['id', '2005', '2006', '2007']

In [12]:
df.columns= list(map(str, df.columns))

In [13]:
df.columns

Index(['id', '2005', '2006', '2007'], dtype='object')

In [14]:
df[['2005']]

   2005
0   100
1   120
2   130

----------